---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.FailToIntersectParallelSegmentsError
source: html/92647d59-b1c4-6e88-6df1-b81d2955f096.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.FailToIntersectParallelSegmentsError Property

The solution is failing to do segments which are parallel and should intersect.

## Syntax (C#)
```csharp
public static FailureDefinitionId FailToIntersectParallelSegmentsError { get; }
```